console.log("7 баллов /(Проверка верстки/) ");
console.log("     + 4 верстка страницы валидная: для проверки валидности вёрстки используйте сервис https://validator.w3.org/ No errors or warnings to show. \n     + 1 логотип в хедере состоит из текстовых элементов \n     + 1 страница содержит ровно один элемент <h1> \n     + 1 добавлен favicon");

console.log(" 35 баллов (Вёрстка соответствует макету)");
console.log("     + 5 блок < header > \n     + 5 блок Not only (start-screen) \n     + 5 блок About \n     + 5 блок Our Friends (pets) \n     + 5 блок Help \n     + 5 блок In addition (donatation) \n     + 5 блок < footer >");

console.log("6 баллов (Требования к css)");
console.log("    + 2 для позиционирования элементов блока Help использована сеточная верстка(flexbox или grid/) \n    + 2 при уменьшении масштаба страницы браузера или увеличении ширины страницы(> 1280px) вёрстка размещается по центру, а не сдвигается в сторону и не растягивается по всей ширине \n    + 2 фоновый цвет тянется на всю ширину страницы");

console.log("12 баллов (Интерактивность элементов)");
console.log("    + 2 элемент About the Shelter в навигации подсвечен и неинтерактивен, остальные элементы навигации интерактивны \n    + 2 каждая карточка с питомцем в блоке Our Friends интерактивна при наведении на любую область этой карточки \n    + 2 плавная прокрутка по якорям \n    + 2 выполняются все ссылочные связи согласно Перечню ссылочных связей для страницы Main \n    + 2 выполнена интерактивность ссылок и кнопок.Интерактивность заключается не только в изменении внешнего вида курсора, например, при помощи свойства cursor: pointer, но и в использовании и других визуальных эффектов, например, изменение цвета фона или цвета шрифта, согласно стайлгайду в макете.Если в макете стили не указаны, реализуете их по своему усмотрению, руководствуясь общим стилем макета \n    + 2 обязательное требование к интерактивности: плавное изменение внешнего вида элемента при наведении и клике, не влияющее на соседние элементы");
console.log("-----------------------------------------");
console.log("ИТОГО 60 баллов");